## 基本操作

In [26]:
import pandas as pd

In [27]:
pd.__version__

'0.23.4'

In [28]:
# 从列表创建series
arr = [0,1,2,3,4]
df = pd.Series(arr)  # 如果不指定索引，则默认从0开始
df

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [29]:
# 从字典创建Series
d = {'a':1,'b':2,'c':3,'d':4,'e':5}
df1 = pd.Series(d)
df1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [30]:
#  从numpy 数组创建DataFrame
import numpy as np
dates = pd.date_range('today',periods=6) # 定义时间序列作为index
num_arr = np.random.randn(6,4)  # 传入numpy随机数组
columns = ['A','B','C','D'] # 将列表作为列名
df2 = pd.DataFrame(num_arr,index=dates, columns=columns)
df2

                                   A         B         C         D
2020-09-06 17:10:58.532825 -0.470960 -2.170770 -0.716729  0.419581
2020-09-07 17:10:58.532825 -0.824351 -0.631464  0.545109 -0.140976
2020-09-08 17:10:58.532825  0.126077  0.207730  0.505030 -0.778180
2020-09-09 17:10:58.532825 -0.561640  0.518210  0.128445 -0.579255
2020-09-10 17:10:58.532825 -0.632132  0.394052  2.914239  0.334286
2020-09-11 17:10:58.532825  1.137612 -0.193618 -0.705878 -0.246879

In [31]:
# 从CSV中创建DataFrame , 分隔符为;  编码为gbk
# df3 = pd.read_csv('1.csv',encoding='gbk',sep=';')

In [32]:
# 从字典对象data创建DataFrame ，设置索引为labels
data = {
    'animal':['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age':[2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority':['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}
labels = ['a','b','c','d','e','f','g','h','i','j']
df = pd.DataFrame(data,index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [33]:
# 显示DataFrame的基础信息，包括行的数量、列名、每一列值的数量、类型
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
animal      10 non-null object
age         8 non-null float64
visits      10 non-null int64
priority    10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

In [34]:
df.describe()

            age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [35]:
# 显示df的前3行
df[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [36]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [37]:
df.head(3)

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [38]:
# 取出df的 animal和age列
df[['animal','age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [39]:
# 取出索引为[3,4,8]的animal列和age列
df.loc[df.index[[3,4,8]], ['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [40]:
# 取出age大于3的行
df[df['age']>3]

  animal  age  visits priority
e    dog  5.0       2       no
g  snake  4.5       1       no
i    dog  7.0       2       no

In [41]:
# 取出age值缺失的行
df[df['age'].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [42]:
# 取出age 大于2 小于4的行
df[(2<df['age'])  &  (df['age'] <4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [43]:
# f行的数据
df.loc['f','age']= 1.5
df.loc['f','age']

1.5

In [44]:
# 取出 age在2，4之间的行(不包含2，4)
df[df['age'].between(2,4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no

In [45]:
# 计算visits的总和
df['visits'].sum()

19

In [46]:
# 计算每个不同种类animal 的age 平均数
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [47]:
df.groupby('animal').age.agg(['mean','min','max','std'])

            mean  min  max       std
animal
cat     2.333333  1.5  3.0  0.763763
dog     5.000000  3.0  7.0  2.000000
snake   2.500000  0.5  4.5  2.828427

In [48]:
# 计算df中每个种类animal的数量
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

In [49]:
# 先按照age降序排，再按visits升序排
df.sort_values(by=['age','visits'],ascending=[False,True])

  animal  age  visits priority
i    dog  7.0       2       no
e    dog  5.0       2       no
g  snake  4.5       1       no
j    dog  3.0       1       no
b    cat  3.0       3      yes
a    cat  2.5       1      yes
f    cat  1.5       3       no
c  snake  0.5       2       no
h    cat  NaN       1      yes
d    dog  NaN       3      yes

In [50]:
# 将priority 列中的yes ，no 替换为True,False
df['priority'] = df['priority'].map({'yes':True,'no':False})
df['priority']

a     True
b     True
c    False
d     True
e    False
f    False
g    False
h     True
i    False
j    False
Name: priority, dtype: bool

In [51]:
df

  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  1.5       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

In [52]:
# 将animal中的snake 替换为 python
df['animal'] = df['animal'].replace('snake','python')
df['animal']

a       cat
b       cat
c    python
d       dog
e       dog
f       cat
g    python
h       cat
i       dog
j       dog
Name: animal, dtype: object

In [53]:
df

   animal  age  visits  priority
a     cat  2.5       1      True
b     cat  3.0       3      True
c  python  0.5       2     False
d     dog  NaN       3      True
e     dog  5.0       2     False
f     cat  1.5       3     False
g  python  4.5       1     False
h     cat  NaN       1      True
i     dog  7.0       2     False
j     dog  3.0       1     False

In [54]:
# 每种animal的 ,每种不同数量visits ,计算平均age
df.dtypes

animal       object
age         float64
visits        int64
priority       bool
dtype: object

In [55]:
df_cp = df
df_cp.age = df_cp.age.astype(float)

In [56]:
df_cp.dtypes

animal       object
age         float64
visits        int64
priority       bool
dtype: object

In [57]:
df_cp.pivot_table(index='animal',columns='visits',values='age',aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

In [58]:
# 插入新行K，再删除
df_cp.loc['k'] = ['dog',5.5,2,'no']

In [59]:
df_cp

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  NaN       3     True
e     dog  5.0       2    False
f     cat  1.5       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False
k     dog  5.5       2       no

In [60]:
df_cp = df_cp.drop('k')

In [61]:
df_cp

   animal  age  visits priority
a     cat  2.5       1     True
b     cat  3.0       3     True
c  python  0.5       2    False
d     dog  NaN       3     True
e     dog  5.0       2    False
f     cat  1.5       3    False
g  python  4.5       1    False
h     cat  NaN       1     True
i     dog  7.0       2    False
j     dog  3.0       1    False

### 进阶操作

In [64]:
# 有一列整数列A的 dataframe ,删除数值重复的行
df1 = pd.DataFrame({
    'A':[1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]
})
df1

# df1 = df1.loc[df['A'].shift() != df1['A']]
## 阐述数值重复的行
df1 = df1.drop_duplicates(subset='A')
df1

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [66]:
# 一个全数值DataFrame ,每个数字减去该行的平均数
df = pd.DataFrame(np.random.random(size=(5,3)))
df

df1 = df.sub(df.mean(axis=1),axis=0)
df1

          0         1         2
0 -0.271193  0.517185 -0.245992
1  0.205996 -0.017855 -0.188141
2  0.112066 -0.150532  0.038466
3 -0.013264  0.102280 -0.089016
4 -0.325870  0.187936  0.137934

In [68]:
# 有一个5列的DataFrame 求哪列和最小
df = pd.DataFrame(np.random.random(size=(5,5)),columns=list('abcde'))
df

df.sum().idxmin()

'a'

In [ ]:
# 给定dataframe 求a列每个值的前3大的和